perf/perf/exchange-scenario.yaml
config:
  environments:
    api:
      target: 'http://nginx'
      plugins:
        statsd:
          host: graphite
          port: 8125
          prefix: "artillery-exchange"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm-up
      duration: 30
      arrivalRate: 1
      rampTo: 3
    - name: Sustained Load
      duration: 120
      arrivalRate: 5
    - name: Peak Load
      duration: 60
      arrivalRate: 10
    - name: Cool-down
      duration: 30
      arrivalRate: 2

scenarios:
  - name: Exchange Operations
    weight: 70
    flow:
      - get:
          url: '/rates'
          capture:
            - json: '$.ARS.USD'
              as: 'usd_rate'
      - post:
          url: '/exchange'
          json:
            baseCurrency: 'USD'
            counterCurrency: 'ARS'
            baseAmount: '{{ $randomInt(10, 1000) }}'
            baseAccountId: 11
            counterAccountId: 10
          expect:
            - statusCode: [200, 500]

  - name: Rate Management
    weight: 20
    flow:
      - get:
          url: '/rates'
      - put:
          url: '/rates'
          json:
            baseCurrency: 'USD'
            counterCurrency: 'ARS'
            rate: '{{ $randomFloat(1400, 1500) }}'

  - name: Account Operations
    weight: 10
    flow:
      - get:
          url: '/accounts'
      - put:
          url: '/accounts/1/balance'
          json:
            balance: '{{ $randomInt(100000000, 200000000) }}'