perf/perf/load-test.yaml
config:
  environments:
    api:
      target: 'http://nginx'
      plugins:
        statsd:
          host: graphite
          port: 8125
          prefix: "artillery-load"

  pool: 100

  phases:
    - name: Baseline
      duration: 60
      arrivalRate: 2
    - name: Ramp Up
      duration: 120
      arrivalRate: 2
      rampTo: 15
    - name: Sustained High Load
      duration: 180
      arrivalRate: 15
    - name: Spike
      duration: 30
      arrivalRate: 25
    - name: Recovery
      duration: 60
      arrivalRate: 5

scenarios:
  - name: Mixed Operations
    weight: 100
    flow:
      - get:
          url: '/rates'
      - post:
          url: '/exchange'
          json:
            baseCurrency: '{{ $pick(["USD", "EUR", "BRL"]) }}'
            counterCurrency: '{{ $pick(["ARS", "USD", "EUR"]) }}'
            baseAmount: '{{ $randomFloat(50, 500) }}'
            baseAccountId: '{{ $randomInt(10, 15) }}'
            counterAccountId: '{{ $randomInt(10, 15) }}'
          expect:
            - statusCode: [200, 500]
      - get:
          url: '/accounts'
      - get:
          url: '/log'